#+AUTHOR: Krzysztof Piecuch
#+TITLE: Does hyperthreading make my NOPs go slower?
#+DATE: 2022-03-30
#+SETUPFILE: https://blog.kpiecuch.pl/css/theme-readtheorg.setup
* Running our benchmark
But first, which logical CPUs are located on the same core?
#+NAME: getting HT information
#+begin_src bash :results verbatim
cat /proc/cpuinfo | grep -Ee '^processor' -e '^core id'
#+end_src

#+RESULTS: getting HT information
#+begin_example
processor	: 0
core id		: 0
processor	: 1
core id		: 0
processor	: 2
core id		: 1
processor	: 3
core id		: 1
processor	: 4
core id		: 2
processor	: 5
core id		: 2
processor	: 6
core id		: 3
processor	: 7
core id		: 3
#+end_example

As we can see, logical CPU 0 is using the same core as logical CPU 1, logical CPU 2 is sharing core with CPU 3 and so on.

So running it without hyperthreading:
#+begin_src bash
  taskset --cpu-list 0 time ./main &; taskset --cpu-list 2 time ./main;
#+end_src

Runnig it by enforcing hyperthreading:
#+begin_src bash
  taskset --cpu-list 0 time ./main &; taskset --cpu-list 1 time ./main;
#+end_src
